In [25]:
import pandas as pd
import numpy as np

pd.set_option('display.max_columns', None)

In [26]:
# Crear un dataframe
df = pd.read_csv('CSV/hr_raw_data_final.csv', index_col=0) ## Añadimos index col para eliminar columna 'Unnamed'

In [28]:
df.head(10)

,age,attrition,businesstravel,dailyrate,department,distancefromhome,education,educationfield,employeecount,employeenumber,environmentsatisfaction,gender,hourlyrate,jobinvolvement,joblevel,jobrole,jobsatisfaction,maritalstatus,monthlyincome,monthlyrate,numcompaniesworked,over18,overtime,percentsalaryhike,performancerating,relationshipsatisfaction,standardhours,stockoptionlevel,totalworkingyears,trainingtimeslastyear,worklifebalance,yearsatcompany,yearsincurrentrole,yearssincelastpromotion,yearswithcurrmanager,sameasmonthlyincome,datebirth,salary,roledepartament,numberchildren,remotework
0,51,No,NaN,2015.722222,NaN,6,3,NaN,1,1,1,0,NaN,3,5,resEArch DIREcToR,3,NaN,"16280,83$","42330,17$",7,Y,No,13,"3,0",3,Full Time,0,NaN,5,"3,0",20,NaN,15,15,"16280,83$",1972,"195370,00$",NaN,NaN,Yes
1,52,No,NaN,2063.388889,NaN,1,4,Life Sciences,1,2,3,0,NaN,2,5,ManAGeR,3,NaN,NaN,"43331,17$",0,NaN,NaN,14,"3,0",1,NaN,1,"34,0",5,"3,0",33,NaN,11,9,NaN,1971,"199990,00$",NaN,NaN,1
2,42,No,travel_rarely,1984.253968,Research & Development,4,2,Technical Degree,1,3,3,0,NaN,3,5,ManaGER,4,Married,NaN,"41669,33$",1,NaN,No,11,"3,0",4,NaN,0,"22,0",3,NaN,22,NaN,11,15,NaN,1981,"192320,00$",ManaGER - Research & Development,NaN,1
3,47,No,travel_rarely,1771.404762,NaN,2,4,Medical,1,4,1,1,NaN,3,4,ReseArCH DIrECtOr,3,Married,"14307,50$","37199,50$",3,Y,NaN,19,"3,0",2,Full Time,2,NaN,2,NaN,20,NaN,5,6,"14307,50$",1976,"171690,00$",NaN,NaN,False
4,46,No,NaN,1582.771346,NaN,3,3,Technical Degree,1,5,1,1,NaN,4,4,sAleS EXECUtIve,1,Divorced,"12783,92$","33238,20$",2,Y,No,12,"3,0",4,NaN,1,NaN,5,"3,0",19,NaN,2,8,"12783,92$",1977,NaN,NaN,NaN,0
5,48,No,NaN,1771.920635,Research & Development,22,3,Medical,1,6,4,1,NaN,3,4,MANAger,4,NaN,"14311,67$","37210,33$",3,NaN,No,11,"3,0",2,NaN,1,NaN,3,"3,0",22,NaN,4,7,"14311,67$",1975,NaN,MANAger - Research & Development,NaN,Yes
6,59,No,NaN,1032.487286,NaN,25,3,Life Sciences,1,7,1,1,NaN,3,3,Sales ExeCutIVe,1,NaN,"8339,32$","21682,23$",7,Y,NaN,11,"3,0",4,Part Time,0,"28,0",3,"2,0",21,NaN,7,9,"8339,32$",1964,"100071,84$",NaN,NaN,True
7,42,No,travel_rarely,556.256661,NaN,1,1,NaN,1,8,2,0,69.532083,3,2,Sales eXEcUTiVe,3,Married,NaN,"11681,39$",1,NaN,No,25,"4,0",3,Part Time,0,"20,0",3,"3,0",20,NaN,11,6,NaN,1981,"53914,11$",NaN,NaN,0
8,41,No,NaN,1712.182540,NaN,2,5,NaN,1,9,2,1,NaN,3,4,mANAGEr,1,Married,"13829,17$","35955,83$",7,NaN,No,16,"3,0",2,Full Time,1,"22,0",2,"3,0",18,NaN,11,8,"13829,17$",1982,"165950,00$",NaN,NaN,True
9,41,No,travel_frequently,1973.984127,NaN,9,3,NaN,1,10,1,0,NaN,3,5,reSEaRCH DIrectoR,3,NaN,"15943,72$","41453,67$",2,NaN,No,17,"3,0",2,NaN,1,"21,0",2,"4,0",18,NaN,0,11,"15943,72$",1982,NaN,NaN,NaN,0

In [8]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 1678 entries, 0 to 1677
Data columns (total 41 columns):
 #   Column                    Non-Null Count  Dtype
---  ------                    --------------  -----
 0   age                       1678 non-null   object
 1   attrition                 1678 non-null   object
 2   businesstravel            877 non-null    object
 3   dailyrate                 1678 non-null   float64
 4   department                312 non-null    object
 5   distancefromhome          1678 non-null   int64
 6   education                 1678 non-null   int64
 7   educationfield            904 non-null    object
 8   employeecount             1678 non-null   int64
 9   employeenumber            1678 non-null   int64
 10  environmentsatisfaction   1678 non-null   int64
 11  gender                    1678 non-null   int64
 12  hourlyrate                411 non-null    float64
 13  jobinvolvement            1678 non-null   int64
 14  joblevel                  1678 non-null   int64
 15  jobrole                   1678 non-null   object
 16  jobsatisfaction           1678 non-null   int64
 17  maritalstatus             1003 non-null   object
 18  monthlyincome             1189 non-null   object
 19  monthlyrate               1678 non-null   object
 20  numcompaniesworked        1678 non-null   int64
 21  over18                    740 non-null    object
 22  overtime                  982 non-null    object
 23  percentsalaryhike         1678 non-null   int64
 24  performancerating         1478 non-null   object
 25  relationshipsatisfaction  1678 non-null   int64
 26  standardhours             1327 non-null   object
 27  stockoptionlevel          1678 non-null   int64
 28  totalworkingyears         1129 non-null   object
 29  trainingtimeslastyear     1678 non-null   int64
 30  worklifebalance           1564 non-null   object
 31  yearsatcompany            1678 non-null   int64
 32  yearsincurrentrole        35 non-null     object
 33  yearssincelastpromotion   1678 non-null   int64
 34  yearswithcurrmanager      1678 non-null   int64
 35  sameasmonthlyincome       1189 non-null   object
 36  datebirth                 1678 non-null   int64
 37  salary                    1393 non-null   object
 38  roledepartament           312 non-null    object
 39  numberchildren            0 non-null      float64
 40  remotework                1678 non-null   object
dtypes: float64(3), int64(18), object(20)
memory usage: 550.6+ KB

In [5]:
# df columnas numéricas
df_numericos = pd.read_csv('CSV/numericos.csv', index_col=0)

In [6]:
df_numericos.info()

<class 'pandas.core.frame.DataFrame'>
Index: 1678 entries, 0 to 1677
Data columns (total 29 columns):
 #   Column                    Non-Null Count  Dtype
---  ------                    --------------  -----
 0   age                       1678 non-null   int64
 1   dailyrate                 1678 non-null   float64
 2   distancefromhome          1678 non-null   int64
 3   education                 1678 non-null   int64
 4   employeecount             1678 non-null   int64
 5   employeenumber            1678 non-null   int64
 6   environmentsatisfaction   1678 non-null   int64
 7   hourlyrate                411 non-null    float64
 8   jobinvolvement            1678 non-null   int64
 9   joblevel                  1678 non-null   int64
 10  jobsatisfaction           1678 non-null   int64
 11  monthlyincome             1189 non-null   float64
 12  monthlyrate               1678 non-null   float64
 13  numcompaniesworked        1678 non-null   int64
 14  percentsalaryhike         1678 non-null   int64
 15  performancerating         1478 non-null   float64
 16  relationshipsatisfaction  1678 non-null   int64
 17  stockoptionlevel          1678 non-null   int64
 18  totalworkingyears         1129 non-null   float64
 19  trainingtimeslastyear     1678 non-null   int64
 20  worklifebalance           1564 non-null   float64
 21  yearsatcompany            1678 non-null   int64
 22  yearsincurrentrole        35 non-null     float64
 23  yearssincelastpromotion   1678 non-null   int64
 24  yearswithcurrmanager      1678 non-null   int64
 25  sameasmonthlyincome       1189 non-null   float64
 26  datebirth                 1678 non-null   int64
 27  salary                    1393 non-null   float64
 28  numberchildren            0 non-null      float64
dtypes: float64(11), int64(18)
memory usage: 393.3 KB

In [10]:
df_numericos

,age,dailyrate,distancefromhome,education,employeecount,employeenumber,environmentsatisfaction,hourlyrate,jobinvolvement,joblevel,...,trainingtimeslastyear,worklifebalance,yearsatcompany,yearsincurrentrole,yearssincelastpromotion,yearswithcurrmanager,sameasmonthlyincome,datebirth,salary,numberchildren
0,51,2015.722222,6,3,1,1,1,NaN,3,5,...,5,3.0,20,NaN,15,15,16280.83,1972,195370.00,NaN
1,52,2063.388889,1,4,1,2,3,NaN,2,5,...,5,3.0,33,NaN,11,9,NaN,1971,199990.00,NaN
2,42,1984.253968,4,2,1,3,3,NaN,3,5,...,3,NaN,22,NaN,11,15,NaN,1981,192320.00,NaN
3,47,1771.404762,2,4,1,4,1,NaN,3,4,...,2,NaN,20,NaN,5,6,14307.50,1976,171690.00,NaN
4,46,1582.771346,3,3,1,5,1,NaN,4,4,...,5,3.0,19,NaN,2,8,12783.92,1977,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1673,43,488.944444,-26,3,1,824,2,NaN,4,1,...,2,3.0,3,NaN,1,2,3949.17,1980,NaN,NaN
1674,47,1973.984127,26,4,1,1087,4,NaN,3,5,...,2,3.0,5,NaN,1,0,15943.72,1976,191324.62,NaN
1675,29,290.035510,15,3,1,528,3,NaN,3,1,...,1,3.0,6,NaN,1,5,NaN,1994,28111.13,NaN
1676,47,1032.487286,4,3,1,76,3,NaN,2,3,...,4,3.0,22,NaN,14,10,8339.32,1976,100071.84,NaN
1677,32,556.256661,2,2,1,401,4,69.532083,3,2,...,2,3.0,8,NaN,0,7,NaN,1991,53914.11,NaN

In [23]:
df_numericos.columns

Index(['age', 'dailyrate', 'distancefromhome', 'education', 'employeecount',
       'employeenumber', 'environmentsatisfaction', 'hourlyrate',
       'jobinvolvement', 'joblevel', 'jobsatisfaction', 'monthlyincome',
       'monthlyrate', 'numcompaniesworked', 'percentsalaryhike',
       'performancerating', 'relationshipsatisfaction', 'stockoptionlevel',
       'totalworkingyears', 'trainingtimeslastyear', 'worklifebalance',
       'yearsatcompany', 'yearsincurrentrole', 'yearssincelastpromotion',
       'yearswithcurrmanager', 'sameasmonthlyincome', 'datebirth', 'salary',
       'numberchildren'],
      dtype='object')

## Información columnas y posibles cambios: 

#### 1) Columna 'age': 

Info: 
- Descripción: La edad del empleado
- Datatype: int64
- Duplicados: N/A (puede repetirse por empleado)
- Nulos: 0 / En caso se ser mayoría de nulos, puede completarse con otra columna?: 
- Columna similar: N/A
- Mantener como columna numérica? Si

#### 2) Columna 'dailyrate': 

Info: 
- Descripción: La tarifa diaria del empleado.
- Datatype: float64 (no redondeado) 
- Duplicados: N/A (el salario diario puede repetirse por empleado)
- Nulos: 0 / En caso se ser mayoría de nulos, puede completarse con otra columna?: 
- Columna similar: N/A
- Mantener como columna numérica? Si

Observaciones / Posibles cambios:
- Mover el decimal una posición a la izquierda (EJ: fila 1677, el hourly rate es 69.532083 y el dailyrate es 556.256661. Si movemos el decimal y dividimos 55.6256661 por 8, da 6.9532083)
- Redondear a dos decimales? 

#### 3) Columna 'distancefromhome': 

Info: 
- Descripción: La distancia desde el hogar del empleado hasta su lugar de trabajo.
- Datatype: int64
- Duplicados: N/A (la distancia puede repetirse por empleado)
- Nulos: 0 / En caso se ser mayoría de nulos, puede completarse con otra columna?: 
- Columna similar: N/A
- Mantener como columna numérica? Si

Observaciones / Posibles cambios:
- Hay distancias negativas (202). Verificar si es posible cambiar a positivo (los km no pueden ser negativos)

-- Contar cuántos valores negativos hay en la columna "distancefromhome": 
negativos = (df["distancefromhome"] < 0).sum()
print(f"Número de valores negativos en 'distancefromhome': {negativos}")-- 

#### 4) Columna 'education': 

Info: 
- Descripción: Nivel de educación del empleado (generalmente en una escala del 1 al 5).
- Datatype: int64
- Duplicados: N/A (la education puede repetirse por empleado)
- Nulos: 0 / En caso se ser mayoría de nulos, puede completarse con otra columna?: No en esta, pero quizas si en la columna educationfield por medio del education level. 
- Columna similar: educationfield?
- Mantener como columna numérica? Si
- Unique: [3, 4, 2, 1, 5]
- Value counts: 
3    649
4    461
2    322
1    186
5     60

Observaciones / Posibles cambios:
- Ver si tiene relación con la columna categorica 'educationfield'. Ver en comprobaciones el código de contingencia: 

#Ver contingencia entre las dos tablas: (para verificar si hay relacion entre education y field) 
contingency_table = pd.crosstab(df['education'], df['educationfield'])
contingency_table

#### 5) Columna 'employeecount': 

Info: 
- Descripción: Un contador que generalmente es 1 y se usa para contar empleados.
- Datatype: int64
- Duplicados: N/A (siempre es 1)
- Nulos: 0 / En caso se ser mayoría de nulos, puede completarse con otra columna?: N/A
- Columna similar: N/A
- Mantener como columna numérica? Si
- Unique: 1
- Value counts: N/A

Observaciones / Posibles cambios:
- Ver si es útil o podemos eliminarlo. 

#### 6) Columna 'employeenumber': 

Info: 
- Descripción: Un número de identificación único para el empleado.
- Datatype: int64
- Duplicados: 64
- Nulos: 0 / En caso se ser mayoría de nulos, puede completarse con otra columna?: N/A
- Columna similar: N/A
- Mantener como columna numérica? Si
- Unique: n/a (son muchos)
- Value_counts: n/a (son muchos)

Observaciones / Posibles cambios:
- Eliminar duplicados. 


#### 7) Columna 'environmentsatisfaction': 

Info: 
- Descripción: Nivel de satisfacción del empleado en relación con su entorno de trabajo. Con valores que estan comprendidos entre el 1 y el 4, siendo el 4 el nivel de máxima satisfacción. 
- Datatype: int64
- Duplicados: 0
- Nulos: 0 / En caso se ser mayoría de nulos, puede completarse con otra columna?: N/A
- Columna similar: N/A
- Mantener como columna numérica? Si
- Unique: *Deberia ser del 1 al 4, pero va del 1 al 49*
- Value_counts: (son muchos)

Observaciones / Posibles cambios:
- Ver si tiene que ver con el departamento o otra columna para modificar los datos. O si es posible que el 49 sea 4,9 o algo asi. 


#### 8) Columna hourlyrate: 

Info: 
- Descripción: La tarifa por hora del empleado.
- Datatype: float64
- Duplicados: N/A
- Nulos: 1267 / En caso se ser mayoría de nulos, puede completarse con otra columna?: (ver con el resto de las columnas salariales)
- Columna similar: N/A
- Mantener como columna numérica? Si

Observaciones / Posibles cambios:
- **************

## Comprobaciones

In [70]:
contingency_table = pd.crosstab(df['education'], df['educationfield'])
contingency_table

educationfield,Human Resources,Life Sciences,Marketing,Medical,Other,Technical Degree
education,,,,,,
1,0,42,9,36,5,10
2,1,67,15,64,12,17
3,6,133,40,116,21,27
4,4,115,34,64,22,14
5,1,10,8,6,3,2

In [29]:
# Contar cuántos valores negativos hay una columna
negativos1 = (df_numericos["hourlyrate"] < 0).sum()
print(f"Número de valores negativos en 'hourlyrate': {negativos1}")

Número de valores negativos en 'hourlyrate': 0

In [30]:
# Verificar duplicados
df_numericos['hourlyrate'].duplicated().sum()

1483

In [31]:
#Ver nulos
df_numericos['hourlyrate'].isnull().sum()

1267

In [32]:
df_numericos["hourlyrate"].unique()

array([         nan,  69.53208262, 172.84325397, 216.04761905,
        79.97321429, 129.06091077, 246.74801587, 207.17460317,
        60.8859127 ,  36.25443872, 139.99503968,  86.24107143,
       197.84641831,  61.06646825, 245.62003968, 123.97718254,
       148.44246032, 255.96329365, 134.41071429,  71.92559524,
       113.78869048, 175.10019841, 247.49007937, 220.83234127,
        91.34821429,  37.77480159, 198.9593254 , 124.05456349,
       247.58035714, 108.48809524,  43.17857143,  68.46924603,
        32.48710317,  55.26289683,  83.46825397,  79.26388889,
        72.28670635,  45.96428571,  31.66170635,  65.19345238,
        52.24503968, 143.9156746 , 113.40178571, 143.19345238,
       139.86607143,  70.57142857,  97.04861111,  45.02281746,
       223.47619048, 134.9781746 ,  74.40178571,  67.14087302,
        58.06150794,  35.05357143,  73.18948413, 164.33134921,
        43.53968254,  54.79861111, 252.59722222,  83.81646825,
        46.71230159,  33.00297619,  70.77777778,  69.23015873,
        54.55357143,  81.53373016, 217.76289683,  50.76190476,
        88.24007937,  57.36507937, 115.2718254 ,  35.77579365,
        59.95734127,  28.20535714,  54.91468254, 227.48710317,
        78.18055556,  54.08928571, 177.0218254 ,  52.9672619 ,
        46.38988095,  80.88888889, 118.70238095,  56.39781746,
        31.33928571,  38.35515873,  35.67261905,  83.99702381,
        55.25      ,  28.70833333,  69.29464286,  69.7718254 ,
        50.86507937,  38.17460317, 244.35615079,  83.37797619,
        25.97420635, 243.02777778,  26.1031746 ,  76.60714286,
        33.81547619,  41.42460317,  89.38789683, 240.71924603,
        82.66865079,  28.03769841,  34.26686508, 141.41369048,
        32.79662698,  68.4047619 ,  84.31944444, 153.92361111,
        50.2202381 ,  26.37400794, 104.72222222,  59.02876984,
        47.82142857,  40.61210317,  32.92559524,  76.51686508,
       141.01388889,  36.09821429,  44.51984127, 106.06349206,
        73.91170635,  32.74503968,  30.64285714,  48.49206349,
        26.82539683,  65.39980159,  70.50694444,  44.10714286,
        41.01190476, 145.01190476,  82.43650794,  42.71428571,
        40.19940476,  29.72718254,  50.38789683,  44.42956349,
        35.5952381 ,  81.17261905,  71.02281746, 104.50297619,
        51.30357143,  34.30555556,  36.22718254,  33.1577381 ,
        32.25496032,  50.55555556,  30.65575397,  57.0297619 ,
        66.68948413, 153.67857143, 120.97222222,  31.82936508,
        27.70238095,  50.11706349,  43.69444444,  58.10019841,
       175.28075397,  85.68650794,  30.56547619,  67.81150794,
        54.12797619,  58.78373016,  33.06746032, 126.6984127 ,
        26.8640873 ,  13.01289683, 101.38194444,  29.32738095,
        27.35416667,  33.53174603,  61.60813492,  36.79464286,
        36.60119048, 108.02380952, 226.55853175,  68.27579365,
        31.42956349,  59.94444444,  14.07043651,  66.43154762,
        27.65079365,  26.69642857,  35.99503968,  74.96924603,
        34.76984127,  29.12103175, 108.23015873, 247.47718254,
        67.42460317,  34.82142857, 133.15972222])

In [ ]:
df_numericos['XXXXXXXXXX'].value_counts()